In [1]:
import pandas as pd

In [2]:
mylist = [1,2,'abc',10]
mylist = [1,2,'srk',55]

In [3]:
type(mylist)

list

In [4]:
df = pd.Series(mylist)  # for 1D mostly --we call it as series 
dff1 = pd.Series(mylist)

In [109]:

myd21 = {'c0':[1,2,3,4,5]}

dm =pd.Series(myd21)
type(dm)

pandas.core.series.Series

In [138]:
dm.name

In [136]:
dm.dtypes.name

'object'

In [5]:
a =df.index # indexes doesnt appear for default indexes.but for userdefined indexes it works.
a

RangeIndex(start=0, stop=4, step=1)

In [6]:

for i in a:
    print(i) # it comes only when we use range

0
1
2
3

In [7]:
type(df)

pandas.core.series.Series

In [8]:
'''
pd.Series(
    ['data=None', 'index=None', 'dtype=None', 'name=None', 'copy=False', 'fastpath=False'],
)
Docstring:     
One-dimensional ndarray with axis labels (including time series).
'''

"\npd.Series(\n    ['data=None', 'index=None', 'dtype=None', 'name=None', 'copy=False', 'fastpath=False'],\n)\nDocstring:     \nOne-dimensional ndarray with axis labels (including time series).\n"

In [9]:
index = ['i0','i1','i2','i3']
index1 = ['i0',1,'i2','i3']

dfi =pd.Series(mylist,index) # capital S for Series
dfi

i0      1
i1      2
i2    srk
i3     55
dtype: object

In [10]:
lst1 = [1,2,3,4]
dfs =pd.Series(mylist,index,dtype =str)
dff=pd.Series(lst1,index,dtype =float,copy =True)

print(dfs)
print(dff)
print(lst1)

i0      1
i1      2
i2    srk
i3     55
dtype: object
i0    1.0
i1    2.0
i2    3.0
i3    4.0
dtype: float64
[1, 2, 3, 4]

In [11]:
df1 =pd.Series(dff,index1) # it takes only the values for indexes that matches dff
df1

i0    1.0
1     NaN
i2    3.0
i3    4.0
dtype: float64

In [12]:
dff.values

array([1., 2., 3., 4.])

In [139]:
dff.count()

4

In [13]:
dff.index

Index(['i0', 'i1', 'i2', 'i3'], dtype='object')

# slicing using indexing

In [14]:
dff['i0']# starts with first index

1.0

In [15]:
dff[0]#starts with zero as first index and same as numpy indexing

1.0

In [16]:
dff[1:4]

i1    2.0
i2    3.0
i3    4.0
dtype: float64

In [17]:
dff['i1':'i3'] # we need to mention the same data type of index i.e strin for 'i1'

i1    2.0
i2    3.0
i3    4.0
dtype: float64

In [18]:
dff[['i1','i3','i0']]  # vector based index # it gives same order of our index.

i1    2.0
i3    4.0
i0    1.0
dtype: float64

In [19]:
dff

i0    1.0
i1    2.0
i2    3.0
i3    4.0
dtype: float64

In [20]:
dff+4  # broadcasting for Series

i0    5.0
i1    6.0
i2    7.0
i3    8.0
dtype: float64

In [21]:
dff*4

i0     4.0
i1     8.0
i2    12.0
i3    16.0
dtype: float64

In [22]:
dff-2

i0   -1.0
i1    0.0
i2    1.0
i3    2.0
dtype: float64

# masking in pandas series

In [23]:
mask =dff<3
print(mask)
dff[mask]

i0     True
i1     True
i2    False
i3    False
dtype: bool

i0    1.0
i1    2.0
dtype: float64

#  passing dict to Series

In [24]:
myd1 = {'Tcs':3000,'RTL':2000,'ONGC':5000,'BIRLA':100}

In [25]:
myd1

{'Tcs': 3000, 'RTL': 2000, 'ONGC': 5000, 'BIRLA': 100}

In [26]:
dfsd =pd.Series(myd1)# It takes keys as ndex and values as values

In [27]:
dfsd[:2]

Tcs    3000
RTL    2000
dtype: int64

# slicing with userdefined indices

In [28]:
dfsd['RTL':'BIRLA'] # slicing with userdefined indices takes  both first and last value also.

RTL      2000
ONGC     5000
BIRLA     100
dtype: int64

In [29]:
dfsd.index #  there is no keyword  index in numpy

Index(['Tcs', 'RTL', 'ONGC', 'BIRLA'], dtype='object')

In [30]:
dfsd.values  # there is no keyword  values in numpy

array([3000, 2000, 5000,  100], dtype=int64)

In [31]:
dfsd.ndim

1

In [32]:
dfsd.shape

(4,)

In [33]:
dfsd.size

4

In [34]:
len(dfsd)

4

In [35]:
dfsd.itemsize

C:\Users\SRK\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.itemsize is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

8

# DataFrame

In [36]:
#pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

In [37]:
myd2 = {'c0':[1,2,3,4,5],'c1':[11,22,33,44,55],'c2':[111,222,333,444,555]}
df1 = pd.DataFrame(myd2)
df1

   c0  c1   c2
0   1  11  111
1   2  22  222
2   3  33  333
3   4  44  444
4   5  55  555

In [38]:
## df2 = pd.DataFrame((df,dff1)) # we cant pass two  series in a DataFrame
##df2
#       ValueError: DataFrame constructor not properly called!

In [96]:
myindex= ['r0', 'r1', 'r2','r3','r4']

In [97]:
df2 = pd.DataFrame(myd2,index =myindex)
df2

    c0  c1   c2
r0   1  11  111
r1   2  22  222
r2   3  33  333
r3   4  44  444
r4   5  55  555

In [98]:
col= ['cs0', 'cs1', 'cs2']

In [99]:
dfc2 = pd.DataFrame(myd2,index =myindex,columns = col)# we cant change existing user defined col-
#                                                       it will compare and overwrite the null data
dfc2



# we can change col names with data  when we pass values pf dataframe(df.values) with out a dataframe.

    cs0  cs1  cs2
r0  NaN  NaN  NaN
r1  NaN  NaN  NaN
r2  NaN  NaN  NaN
r3  NaN  NaN  NaN
r4  NaN  NaN  NaN

In [103]:
myd22 = [[1,2,3],[11,22,33],[111,222,333]]
myindex1= ['r0', 'r1', 'r2']
dfc22 = pd.DataFrame(myd22,index =myindex1,columns = col,dtype =float)  # default can only be modified,
dfc22

      cs0    cs1    cs2
r0    1.0    2.0    3.0
r1   11.0   22.0   33.0
r2  111.0  222.0  333.0

In [107]:
type(dfc22)

pandas.core.frame.DataFrame

In [106]:
type(dfc22['cs0'])

pandas.core.series.Series

In [ ]:
dfc22.index

In [ ]:
dfc22.values

In [110]:
dfc22.columns # we get columns of a dataframe.

Index(['cs0', 'cs1', 'cs2'], dtype='object')

In [111]:
n1 = df2.values
n1

array([[  1,  11, 111],
       [  2,  22, 222],
       [  3,  33, 333],
       [  4,  44, 444],
       [  5,  55, 555]], dtype=int64)

In [112]:
type(n1)

numpy.ndarray

In [113]:
n1.shape# now we can use all numpy functionalities to n1 as 1 id nd array.

(5, 3)

In [114]:
n1.size

15

In [115]:
len(n1)

5

In [140]:
df3 = pd.read_csv(r'C:\Users\SRK\Desktop\siva_python\numpypandas_plots week 2\Day_6_numpy_pandas\profit1.csv')
df3

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [141]:
df3.index

Index(['HCL', 'MRF', 'ISROACL', 'Reliance', 'BCCI', 'Birla', 'Flipkart',
       'Apollo', 'IR'],
      dtype='object')

In [142]:
type(df3.Vol)

pandas.core.series.Series

In [143]:
df3.columns

Index(['Vol', 'Rev', 'Exp', 'Catg', 'EmpCnt', 'HQ'], dtype='object')

In [144]:
df3.values

array([[931, 863, 605, 'Pub', 1935, 'NCR'],
       [992, 821, 665, 'Pub', 1154, 'Che'],
       [931, 881, 650, 'Gov', 1361, 'Blr'],
       [899, 217, 674, 'Pub', 1443, 'Mum'],
       [925, 839, 615, 'Pvt', 154, 'Mum'],
       [900, 874, 676, 'Pub', 1379, 'Kol'],
       [966, 805, 695, 'Pvt', 119, 'Blr'],
       [966, 863, 608, 'Pub', 1656, 'Che'],
       [954, 833, 609, 'Gov', 13023, 'NCR']], dtype=object)

In [145]:
df3.head()# defailt value is 5 --- df3.head(n=5)

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum

In [146]:
df3.head(3)---

SyntaxError: invalid syntax (<ipython-input-146-ce846d3a974d>, line 1)

In [147]:
df3.tail()

          Vol  Rev  Exp Catg  EmpCnt   HQ
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [148]:
df3.tail(3)# last 3 values

          Vol  Rev  Exp Catg  EmpCnt   HQ
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [149]:
df3.info()#df3.info(
  #  ['verbose=None', 'buf=None', 'max_cols=None', 'memory_usage=None', 'null_counts=None'],)

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, HCL to IR
Data columns (total 6 columns):
Vol       9 non-null int64
Rev       9 non-null int64
Exp       9 non-null int64
Catg      9 non-null object
EmpCnt    9 non-null int64
HQ        9 non-null object
dtypes: int64(4), object(2)
memory usage: 504.0+ bytes

In [153]:
pd.to_numeric(df3.HQ,errors='coerce')

HCL        NaN
MRF        NaN
ISROACL    NaN
Reliance   NaN
BCCI       NaN
Birla      NaN
Flipkart   NaN
Apollo     NaN
IR         NaN
Name: HQ, dtype: float64

In [154]:
df3.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, HCL to IR
Data columns (total 6 columns):
Vol       9 non-null int64
Rev       9 non-null int64
Exp       9 non-null int64
Catg      9 non-null object
EmpCnt    9 non-null int64
HQ        9 non-null object
dtypes: int64(4), object(2)
memory usage: 824.0+ bytes

In [155]:
df3.describe()#df3.describe(percentiles=None, include=None, exclude=None)

              Vol         Rev         Exp        EmpCnt
count    9.000000    9.000000    9.000000      9.000000
mean   940.444444  777.333333  644.111111   2469.333333
std     31.460734  211.635300   35.151260   4006.439036
min    899.000000  217.000000  605.000000    119.000000
25%    925.000000  821.000000  609.000000   1154.000000
50%    931.000000  839.000000  650.000000   1379.000000
75%    966.000000  863.000000  674.000000   1656.000000
max    992.000000  881.000000  695.000000  13023.000000

In [156]:
df3.count()  #Count non-NA cells for each column or row.
#df3.count(axis=0, level=None, numeric_only=False)

Vol       9
Rev       9
Exp       9
Catg      9
EmpCnt    9
HQ        9
dtype: int64

In [157]:
df3['Vol'].count()

9

In [158]:
df3.count(axis =1,numeric_only =True)

HCL         4
MRF         4
ISROACL     4
Reliance    4
BCCI        4
Birla       4
Flipkart    4
Apollo      4
IR          4
dtype: int64

In [159]:
df3.Vol.count()

9

In [160]:
df3['Vol'].value_counts()# with in a col no of element in each group
#df3.HQ.
#value_counts(['normalize=False', 'sort=True', 'ascending=False', 'bins=None', 'dropna=True'],

966    2
931    2
925    1
899    1
954    1
900    1
992    1
Name: Vol, dtype: int64

In [161]:
df3.HQ.value_counts()

Mum    2
NCR    2
Blr    2
Che    2
Kol    1
Name: HQ, dtype: int64

In [162]:
df3.HQ.value_counts(sort =True,ascending=True,dropna=True)
# it will sort only values and ascendingonly  for values

Kol    1
Che    2
Blr    2
NCR    2
Mum    2
Name: HQ, dtype: int64

In [163]:
df3['Catg']

HCL         Pub
MRF         Pub
ISROACL     Gov
Reliance    Pub
BCCI        Pvt
Birla       Pub
Flipkart    Pvt
Apollo      Pub
IR          Gov
Name: Catg, dtype: object

# for multiple columns selection

In [164]:
df3[['Catg','HQ']]# for multiple columns slicing

         Catg   HQ
HCL       Pub  NCR
MRF       Pub  Che
ISROACL   Gov  Blr
Reliance  Pub  Mum
BCCI      Pvt  Mum
Birla     Pub  Kol
Flipkart  Pvt  Blr
Apollo    Pub  Che
IR        Gov  NCR

In [165]:
df3[1:2]# its not possible to slice with indices for both row and col at a time, we use iloc for this.

     Vol  Rev  Exp Catg  EmpCnt   HQ
MRF  992  821  665  Pub    1154  Che

In [166]:
# index slicing

In [167]:
df3

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [168]:
df3.iloc[0]  #Purely integer-location based indexing for selection by position.

Vol        931
Rev        863
Exp        605
Catg       Pub
EmpCnt    1935
HQ         NCR
Name: HCL, dtype: object

In [169]:
df3.iloc[0,1]

863

In [170]:
df3.iloc[0,1:5]

Rev        863
Exp        605
Catg       Pub
EmpCnt    1935
Name: HCL, dtype: object

In [171]:
df3.iloc[:4,1:5]

          Rev  Exp Catg  EmpCnt
HCL       863  605  Pub    1935
MRF       821  665  Pub    1154
ISROACL   881  650  Gov    1361
Reliance  217  674  Pub    1443

In [172]:
df3.iloc[[1,3,4],1:5]

          Rev  Exp Catg  EmpCnt
MRF       821  665  Pub    1154
Reliance  217  674  Pub    1443
BCCI      839  615  Pvt     154

In [173]:
df3.iloc[[1,3,4],[1,2,3]] # no zipping ## df.iloc[[rowvector],[colvector]]

          Rev  Exp Catg
MRF       821  665  Pub
Reliance  217  674  Pub
BCCI      839  615  Pvt

In [174]:
df3.iloc[::-1,[2,5,3]]

          Exp   HQ Catg
IR        609  NCR  Gov
Apollo    608  Che  Pub
Flipkart  695  Blr  Pvt
Birla     676  Kol  Pub
BCCI      615  Mum  Pvt
Reliance  674  Mum  Pub
ISROACL   650  Blr  Gov
MRF       665  Che  Pub
HCL       605  NCR  Pub

In [175]:
df3.iloc[-4:-7:-1,[2,5,3]]

          Exp   HQ Catg
Birla     676  Kol  Pub
BCCI      615  Mum  Pvt
Reliance  674  Mum  Pub

In [176]:
df3.iloc[5:2:-1,[2,5,3]]

          Exp   HQ Catg
Birla     676  Kol  Pub
BCCI      615  Mum  Pvt
Reliance  674  Mum  Pub

# label based ----LOC

In [177]:
df3.loc['MRF',"HQ"]

'Che'

In [178]:
df3

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [179]:
df3.iloc[-9:4,[2,4]]

          Exp  EmpCnt
HCL       605    1935
MRF       665    1154
ISROACL   650    1361
Reliance  674    1443

# Loc --label based

In [180]:
df3.loc['MRF',"HQ"]

'Che'

In [181]:
df3.loc[["MRF","BCCI"],["HQ",'Catg',"Vol"]]

       HQ Catg  Vol
MRF   Che  Pub  992
BCCI  Mum  Pvt  925

In [182]:
df3.loc['MRF':'Apollo':2,"Rev":'Catg']

          Rev  Exp Catg
MRF       821  665  Pub
Reliance  217  674  Pub
Birla     874  676  Pub
Apollo    863  608  Pub

In [183]:
df3.loc[['MRF','Apollo'],["Rev",'Catg']]

        Rev Catg
MRF     821  Pub
Apollo  863  Pub

### masking

In [184]:
df3[df3.Catg =='Pub']

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
Reliance  899  217  674  Pub    1443  Mum
Birla     900  874  676  Pub    1379  Kol
Apollo    966  863  608  Pub    1656  Che

In [185]:
df3[(df3.HQ=="Che") & (df3.Catg=="Pub")]

        Vol  Rev  Exp Catg  EmpCnt   HQ
MRF     992  821  665  Pub    1154  Che
Apollo  966  863  608  Pub    1656  Che

In [192]:
df3.loc['HCL',"HQ"] ="Mum"
df3

            Vol    Rev    Exp Catg   EmpCnt   HQ  HCL
HCL       931.0  863.0  605.0  Pub   1935.0  Mum  NaN
MRF       992.0  821.0  665.0  Pub   1154.0  Che  NaN
ISROACL   931.0  881.0  650.0  Gov   1361.0  Blr  NaN
Reliance  899.0  217.0  674.0  Pub   1443.0  Mum  NaN
BCCI      925.0  839.0  615.0  Pvt    154.0  Mum  NaN
Birla     900.0  874.0  676.0  Pub   1379.0  Kol  NaN
Flipkart  966.0  805.0  695.0  Pvt    119.0  Blr  NaN
Apollo    966.0  863.0  608.0  Pub   1656.0  Che  NaN
IR        954.0  833.0  609.0  Gov  13023.0  NCR  NaN
HQ          NaN    NaN    NaN  NaN      NaN  NaN  DOn

In [193]:
df3.loc['HQ',"HCL"] ="DOn"  #if row,col not preent it creates a new one .

In [194]:
df3

            Vol    Rev    Exp Catg   EmpCnt   HQ  HCL
HCL       931.0  863.0  605.0  Pub   1935.0  Mum  NaN
MRF       992.0  821.0  665.0  Pub   1154.0  Che  NaN
ISROACL   931.0  881.0  650.0  Gov   1361.0  Blr  NaN
Reliance  899.0  217.0  674.0  Pub   1443.0  Mum  NaN
BCCI      925.0  839.0  615.0  Pvt    154.0  Mum  NaN
Birla     900.0  874.0  676.0  Pub   1379.0  Kol  NaN
Flipkart  966.0  805.0  695.0  Pvt    119.0  Blr  NaN
Apollo    966.0  863.0  608.0  Pub   1656.0  Che  NaN
IR        954.0  833.0  609.0  Gov  13023.0  NCR  NaN
HQ          NaN    NaN    NaN  NaN      NaN  NaN  DOn

# sorted_index

In [196]:
df4 =pd.read_csv(r'C:\Users\SRK\Desktop\siva_python\numpypandas_plots week 2\Day_6_numpy_pandas\profit1.csv')
df4.sort_index()
#sort_index(['axis=0', 'level=None', 'ascending=True', 'inplace=False', "kind='quicksort'", 
#"na_position='last'", 'sort_remaining=True', 'by=None'],)

          Vol  Rev  Exp Catg  EmpCnt   HQ
Apollo    966  863  608  Pub    1656  Che
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
HCL       931  863  605  Pub    1935  NCR
IR        954  833  609  Gov   13023  NCR
ISROACL   931  881  650  Gov    1361  Blr
MRF       992  821  665  Pub    1154  Che
Reliance  899  217  674  Pub    1443  Mum

In [197]:
df4.sort_index(axis =1)

         Catg  EmpCnt  Exp   HQ  Rev  Vol
HCL       Pub    1935  605  NCR  863  931
MRF       Pub    1154  665  Che  821  992
ISROACL   Gov    1361  650  Blr  881  931
Reliance  Pub    1443  674  Mum  217  899
BCCI      Pvt     154  615  Mum  839  925
Birla     Pub    1379  676  Kol  874  900
Flipkart  Pvt     119  695  Blr  805  966
Apollo    Pub    1656  608  Che  863  966
IR        Gov   13023  609  NCR  833  954

In [199]:
df4.sort_index(axis =0)

          Vol  Rev  Exp Catg  EmpCnt   HQ
Apollo    966  863  608  Pub    1656  Che
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
HCL       931  863  605  Pub    1935  NCR
IR        954  833  609  Gov   13023  NCR
ISROACL   931  881  650  Gov    1361  Blr
MRF       992  821  665  Pub    1154  Che
Reliance  899  217  674  Pub    1443  Mum

In [200]:
df4.sort_index(axis =0,by ='HQ')

C:\Users\SRK\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

          Vol  Rev  Exp Catg  EmpCnt   HQ
ISROACL   931  881  650  Gov    1361  Blr
Flipkart  966  805  695  Pvt     119  Blr
MRF       992  821  665  Pub    1154  Che
Apollo    966  863  608  Pub    1656  Che
Birla     900  874  676  Pub    1379  Kol
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
HCL       931  863  605  Pub    1935  NCR
IR        954  833  609  Gov   13023  NCR

In [202]:
df4.sort_values(by ='HQ')

          Vol  Rev  Exp Catg  EmpCnt   HQ
ISROACL   931  881  650  Gov    1361  Blr
Flipkart  966  805  695  Pvt     119  Blr
MRF       992  821  665  Pub    1154  Che
Apollo    966  863  608  Pub    1656  Che
Birla     900  874  676  Pub    1379  Kol
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
HCL       931  863  605  Pub    1935  NCR
IR        954  833  609  Gov   13023  NCR

In [203]:
df4.sort_values(by ='Apollo',axis =1) # we cant sort number and string

TypeError: '>' not supported between instances of 'numpy.ndarray' and 'str'

In [204]:
df4.sort_values(by ='HQ',na_position='first')# puts nan at first , if they are available

          Vol  Rev  Exp Catg  EmpCnt   HQ
ISROACL   931  881  650  Gov    1361  Blr
Flipkart  966  805  695  Pvt     119  Blr
MRF       992  821  665  Pub    1154  Che
Apollo    966  863  608  Pub    1656  Che
Birla     900  874  676  Pub    1379  Kol
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
HCL       931  863  605  Pub    1935  NCR
IR        954  833  609  Gov   13023  NCR

In [205]:
df4.sort_values(by =['Catg','HQ'])

          Vol  Rev  Exp Catg  EmpCnt   HQ
ISROACL   931  881  650  Gov    1361  Blr
IR        954  833  609  Gov   13023  NCR
MRF       992  821  665  Pub    1154  Che
Apollo    966  863  608  Pub    1656  Che
Birla     900  874  676  Pub    1379  Kol
Reliance  899  217  674  Pub    1443  Mum
HCL       931  863  605  Pub    1935  NCR
Flipkart  966  805  695  Pvt     119  Blr
BCCI      925  839  615  Pvt     154  Mum

In [206]:
df5 = df4.drop(['HQ','Catg'],axis =1) # drop the coloumn or row
print(df5)
#df4.drop(['labels=None', 'axis=0', 'index=None', 'columns=None', 'level=None', 'inplace=False', "errors='raise'"],)

          Vol  Rev  Exp  EmpCnt
HCL       931  863  605    1935
MRF       992  821  665    1154
ISROACL   931  881  650    1361
Reliance  899  217  674    1443
BCCI      925  839  615     154
Birla     900  874  676    1379
Flipkart  966  805  695     119
Apollo    966  863  608    1656
IR        954  833  609   13023

In [207]:
df5.drop([])

          Vol  Rev  Exp  EmpCnt
HCL       931  863  605    1935
MRF       992  821  665    1154
ISROACL   931  881  650    1361
Reliance  899  217  674    1443
BCCI      925  839  615     154
Birla     900  874  676    1379
Flipkart  966  805  695     119
Apollo    966  863  608    1656
IR        954  833  609   13023

In [208]:
x = df5.sort_values(by ='HCL',axis =1)
print(x)

          Exp  Rev  Vol  EmpCnt
HCL       605  863  931    1935
MRF       665  821  992    1154
ISROACL   650  881  931    1361
Reliance  674  217  899    1443
BCCI      615  839  925     154
Birla     676  874  900    1379
Flipkart  695  805  966     119
Apollo    608  863  966    1656
IR        609  833  954   13023

In [210]:
df5 = df4.iloc[:,[0,1,4]]
print(df5)
x = df5.sort_values(by ='HCL',axis =1)
print(x)

          Vol  Rev  EmpCnt
HCL       931  863    1935
MRF       992  821    1154
ISROACL   931  881    1361
Reliance  899  217    1443
BCCI      925  839     154
Birla     900  874    1379
Flipkart  966  805     119
Apollo    966  863    1656
IR        954  833   13023
          Rev  Vol  EmpCnt
HCL       863  931    1935
MRF       821  992    1154
ISROACL   881  931    1361
Reliance  217  899    1443
BCCI      839  925     154
Birla     874  900    1379
Flipkart  805  966     119
Apollo    863  966    1656
IR        833  954   13023

In [211]:
df4.sort_values(by =['Vol','EmpCnt'],ascending =[True,False])

          Vol  Rev  Exp Catg  EmpCnt   HQ
Reliance  899  217  674  Pub    1443  Mum
Birla     900  874  676  Pub    1379  Kol
BCCI      925  839  615  Pvt     154  Mum
HCL       931  863  605  Pub    1935  NCR
ISROACL   931  881  650  Gov    1361  Blr
IR        954  833  609  Gov   13023  NCR
Apollo    966  863  608  Pub    1656  Che
Flipkart  966  805  695  Pvt     119  Blr
MRF       992  821  665  Pub    1154  Che

In [212]:
df4.Vol.mean()

940.4444444444445

In [213]:
df4['Vol'].mean()

940.4444444444445

In [214]:
df4['Vol'].mode()

0    931
1    966
dtype: int64

In [215]:
df4.mode()# it arranges mode value in order.which makes less sense.

     Vol    Rev  Exp Catg  EmpCnt   HQ
0  931.0  863.0  605  Pub     119  Blr
1  966.0    NaN  608  NaN     154  Che
2    NaN    NaN  609  NaN    1154  Mum
3    NaN    NaN  615  NaN    1361  NCR
4    NaN    NaN  650  NaN    1379  NaN
5    NaN    NaN  665  NaN    1443  NaN
6    NaN    NaN  674  NaN    1656  NaN
7    NaN    NaN  676  NaN    1935  NaN
8    NaN    NaN  695  NaN   13023  NaN

In [216]:
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [217]:
df4['Vol'].median()
#df4.median(axis=None, skipna=None, level=None, numeric_only=None, **kwargs)

931.0

# Rank

In [219]:
df4 = pd.read_csv(r'C:\Users\SRK\Desktop\siva_python\numpypandas_plots week 2\Day_6_numpy_pandas\profit1.csv')
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ
HCL       931  863  605  Pub    1935  NCR
MRF       992  821  665  Pub    1154  Che
ISROACL   931  881  650  Gov    1361  Blr
Reliance  899  217  674  Pub    1443  Mum
BCCI      925  839  615  Pvt     154  Mum
Birla     900  874  676  Pub    1379  Kol
Flipkart  966  805  695  Pvt     119  Blr
Apollo    966  863  608  Pub    1656  Che
IR        954  833  609  Gov   13023  NCR

In [221]:
df4['Vol'].rank(axis =0)
#df4.rank(
   # ['axis=0', "method='average'", 'numeric_only=None', "na_option='keep'", 'ascending=True', 
   #  'pct=False'],)

HCL         4.5
MRF         9.0
ISROACL     4.5
Reliance    1.0
BCCI        3.0
Birla       2.0
Flipkart    7.5
Apollo      7.5
IR          6.0
Name: Vol, dtype: float64

In [222]:
df4['min_rank']=df4['Vol'].rank(axis =0,method ='min',ascending =False)
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ  min_rank
HCL       931  863  605  Pub    1935  NCR       5.0
MRF       992  821  665  Pub    1154  Che       1.0
ISROACL   931  881  650  Gov    1361  Blr       5.0
Reliance  899  217  674  Pub    1443  Mum       9.0
BCCI      925  839  615  Pvt     154  Mum       7.0
Birla     900  874  676  Pub    1379  Kol       8.0
Flipkart  966  805  695  Pvt     119  Blr       2.0
Apollo    966  863  608  Pub    1656  Che       2.0
IR        954  833  609  Gov   13023  NCR       4.0

In [223]:
df4['max_rank']=df4['Vol'].rank(axis =0,method ='max',ascending =False)
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ  min_rank  max_rank
HCL       931  863  605  Pub    1935  NCR       5.0       6.0
MRF       992  821  665  Pub    1154  Che       1.0       1.0
ISROACL   931  881  650  Gov    1361  Blr       5.0       6.0
Reliance  899  217  674  Pub    1443  Mum       9.0       9.0
BCCI      925  839  615  Pvt     154  Mum       7.0       7.0
Birla     900  874  676  Pub    1379  Kol       8.0       8.0
Flipkart  966  805  695  Pvt     119  Blr       2.0       3.0
Apollo    966  863  608  Pub    1656  Che       2.0       3.0
IR        954  833  609  Gov   13023  NCR       4.0       4.0

In [224]:
df4['dense_rank']=df4['Vol'].rank(axis =0,method ='dense',ascending =False)
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ  min_rank  max_rank  dense_rank
HCL       931  863  605  Pub    1935  NCR       5.0       6.0         4.0
MRF       992  821  665  Pub    1154  Che       1.0       1.0         1.0
ISROACL   931  881  650  Gov    1361  Blr       5.0       6.0         4.0
Reliance  899  217  674  Pub    1443  Mum       9.0       9.0         7.0
BCCI      925  839  615  Pvt     154  Mum       7.0       7.0         5.0
Birla     900  874  676  Pub    1379  Kol       8.0       8.0         6.0
Flipkart  966  805  695  Pvt     119  Blr       2.0       3.0         2.0
Apollo    966  863  608  Pub    1656  Che       2.0       3.0         2.0
IR        954  833  609  Gov   13023  NCR       4.0       4.0         3.0

In [225]:
import numpy as np
df5 =df4.drop(df4.select_dtypes(include = np.object),axis =1);print(df5)
(df5.loc[['HCL','Reliance']]).rank(axis =1)

          Vol  Rev  Exp  EmpCnt  min_rank  max_rank  dense_rank
HCL       931  863  605    1935       5.0       6.0         4.0
MRF       992  821  665    1154       1.0       1.0         1.0
ISROACL   931  881  650    1361       5.0       6.0         4.0
Reliance  899  217  674    1443       9.0       9.0         7.0
BCCI      925  839  615     154       7.0       7.0         5.0
Birla     900  874  676    1379       8.0       8.0         6.0
Flipkart  966  805  695     119       2.0       3.0         2.0
Apollo    966  863  608    1656       2.0       3.0         2.0
IR        954  833  609   13023       4.0       4.0         3.0

          Vol  Rev  Exp  EmpCnt  min_rank  max_rank  dense_rank
HCL       6.0  5.0  4.0     7.0       2.0       3.0         1.0
Reliance  6.0  4.0  5.0     7.0       2.5       2.5         1.0

In [226]:
df4.dtypes.tolist()

[dtype('int64'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('float64'),
 dtype('float64')]

In [227]:
df6 =df4.transpose() #or df4.T/

In [228]:
df6

             HCL   MRF ISROACL Reliance BCCI Birla Flipkart Apollo     IR
Vol          931   992     931      899  925   900      966    966    954
Rev          863   821     881      217  839   874      805    863    833
Exp          605   665     650      674  615   676      695    608    609
Catg         Pub   Pub     Gov      Pub  Pvt   Pub      Pvt    Pub    Gov
EmpCnt      1935  1154    1361     1443  154  1379      119   1656  13023
HQ           NCR   Che     Blr      Mum  Mum   Kol      Blr    Che    NCR
min_rank       5     1       5        9    7     8        2      2      4
max_rank       6     1       6        9    7     8        3      3      4
dense_rank     4     1       4        7    5     6        2      2      3

In [229]:
df4.rank(axis=1,numeric_only=True)

          Vol  Rev  Exp  EmpCnt  min_rank  max_rank  dense_rank
HCL       6.0  5.0  4.0     7.0       2.0       3.0         1.0
MRF       6.0  5.0  4.0     7.0       2.0       2.0         2.0
ISROACL   6.0  5.0  4.0     7.0       2.0       3.0         1.0
Reliance  6.0  4.0  5.0     7.0       2.5       2.5         1.0
BCCI      7.0  6.0  5.0     4.0       2.5       2.5         1.0
Birla     6.0  5.0  4.0     7.0       2.5       2.5         1.0
Flipkart  7.0  6.0  5.0     4.0       1.5       3.0         1.5
Apollo    6.0  5.0  4.0     7.0       1.5       3.0         1.5
IR        6.0  5.0  4.0     7.0       2.5       2.5         1.0

In [230]:
dd1 =df4.drop('Vol',axis=1)
dd1

          Rev  Exp Catg  EmpCnt   HQ  min_rank  max_rank  dense_rank
HCL       863  605  Pub    1935  NCR       5.0       6.0         4.0
MRF       821  665  Pub    1154  Che       1.0       1.0         1.0
ISROACL   881  650  Gov    1361  Blr       5.0       6.0         4.0
Reliance  217  674  Pub    1443  Mum       9.0       9.0         7.0
BCCI      839  615  Pvt     154  Mum       7.0       7.0         5.0
Birla     874  676  Pub    1379  Kol       8.0       8.0         6.0
Flipkart  805  695  Pvt     119  Blr       2.0       3.0         2.0
Apollo    863  608  Pub    1656  Che       2.0       3.0         2.0
IR        833  609  Gov   13023  NCR       4.0       4.0         3.0

In [231]:
dd1 =dd1.drop(index =['ISROACL','BCCI'],columns =['Exp','EmpCnt'])
dd1

          Rev Catg   HQ  min_rank  max_rank  dense_rank
HCL       863  Pub  NCR       5.0       6.0         4.0
MRF       821  Pub  Che       1.0       1.0         1.0
Reliance  217  Pub  Mum       9.0       9.0         7.0
Birla     874  Pub  Kol       8.0       8.0         6.0
Flipkart  805  Pvt  Blr       2.0       3.0         2.0
Apollo    863  Pub  Che       2.0       3.0         2.0
IR        833  Gov  NCR       4.0       4.0         3.0

In [232]:
dd1 =dd1.drop(index = ['Birla','Apollo'],columns =['min_rank','max_rank'])
dd1

## label , axis =0 ---> index
## label,axis =1 ---> col
## if we want to drop both col, row at a time we need to use index, col,instead of label, axis

          Rev Catg   HQ  dense_rank
HCL       863  Pub  NCR         4.0
MRF       821  Pub  Che         1.0
Reliance  217  Pub  Mum         7.0
Flipkart  805  Pvt  Blr         2.0
IR        833  Gov  NCR         3.0

# Ranking by Groups

In [233]:
df4

          Vol  Rev  Exp Catg  EmpCnt   HQ  min_rank  max_rank  dense_rank
HCL       931  863  605  Pub    1935  NCR       5.0       6.0         4.0
MRF       992  821  665  Pub    1154  Che       1.0       1.0         1.0
ISROACL   931  881  650  Gov    1361  Blr       5.0       6.0         4.0
Reliance  899  217  674  Pub    1443  Mum       9.0       9.0         7.0
BCCI      925  839  615  Pvt     154  Mum       7.0       7.0         5.0
Birla     900  874  676  Pub    1379  Kol       8.0       8.0         6.0
Flipkart  966  805  695  Pvt     119  Blr       2.0       3.0         2.0
Apollo    966  863  608  Pub    1656  Che       2.0       3.0         2.0
IR        954  833  609  Gov   13023  NCR       4.0       4.0         3.0

In [234]:
df4['Volrank'] =df4.groupby('Catg')['Vol'].rank()
df4

,Vol,Rev,Exp,Catg,EmpCnt,HQ,min_rank,max_rank,dense_rank,Volrank
HCL,931,863,605,Pub,1935,NCR,5.0,6.0,4.0,3.0
MRF,992,821,665,Pub,1154,Che,1.0,1.0,1.0,5.0
ISROACL,931,881,650,Gov,1361,Blr,5.0,6.0,4.0,1.0
Reliance,899,217,674,Pub,1443,Mum,9.0,9.0,7.0,1.0
BCCI,925,839,615,Pvt,154,Mum,7.0,7.0,5.0,1.0
Birla,900,874,676,Pub,1379,Kol,8.0,8.0,6.0,2.0
Flipkart,966,805,695,Pvt,119,Blr,2.0,3.0,2.0,2.0
Apollo,966,863,608,Pub,1656,Che,2.0,3.0,2.0,4.0
IR,954,833,609,Gov,13023,NCR,4.0,4.0,3.0,2.0

In [235]:
df4.sort_values(by = ['Catg','Vol'])

,Vol,Rev,Exp,Catg,EmpCnt,HQ,min_rank,max_rank,dense_rank,Volrank
ISROACL,931,881,650,Gov,1361,Blr,5.0,6.0,4.0,1.0
IR,954,833,609,Gov,13023,NCR,4.0,4.0,3.0,2.0
Reliance,899,217,674,Pub,1443,Mum,9.0,9.0,7.0,1.0
Birla,900,874,676,Pub,1379,Kol,8.0,8.0,6.0,2.0
HCL,931,863,605,Pub,1935,NCR,5.0,6.0,4.0,3.0
Apollo,966,863,608,Pub,1656,Che,2.0,3.0,2.0,4.0
MRF,992,821,665,Pub,1154,Che,1.0,1.0,1.0,5.0
BCCI,925,839,615,Pvt,154,Mum,7.0,7.0,5.0,1.0
Flipkart,966,805,695,Pvt,119,Blr,2.0,3.0,2.0,2.0

In [236]:
df4.groupby('Catg')['Vol'].rank()
#df4.groupby(['by=None', 'axis=0', 'level=None', 'as_index=True', 'sort=True', 'group_keys=True', 'squeeze=False', 'observed=False', '**kwargs'],)

HCL         3.0
MRF         5.0
ISROACL     1.0
Reliance    1.0
BCCI        1.0
Birla       2.0
Flipkart    2.0
Apollo      4.0
IR          2.0
Name: Vol, dtype: float64

In [237]:
#df4.groupby(['Catg','Vol']).rank()
a =df4.groupby('Catg')['Vol'].mean()
a

Catg
Gov    942.5
Pub    937.6
Pvt    945.5
Name: Vol, dtype: float64

In [238]:
df4.groupby(['Catg','HQ']).first()

          Vol  Rev  Exp  EmpCnt  min_rank  max_rank  dense_rank  Volrank
Catg HQ
Gov  Blr  931  881  650    1361       5.0       6.0         4.0      1.0
     NCR  954  833  609   13023       4.0       4.0         3.0      2.0
Pub  Che  992  821  665    1154       1.0       1.0         1.0      5.0
     Kol  900  874  676    1379       8.0       8.0         6.0      2.0
     Mum  899  217  674    1443       9.0       9.0         7.0      1.0
     NCR  931  863  605    1935       5.0       6.0         4.0      3.0
Pvt  Blr  966  805  695     119       2.0       3.0         2.0      2.0
     Mum  925  839  615     154       7.0       7.0         5.0      1.0

In [239]:
df4.groupby(['Catg','HQ']).first()

          Vol  Rev  Exp  EmpCnt  min_rank  max_rank  dense_rank  Volrank
Catg HQ
Gov  Blr  931  881  650    1361       5.0       6.0         4.0      1.0
     NCR  954  833  609   13023       4.0       4.0         3.0      2.0
Pub  Che  992  821  665    1154       1.0       1.0         1.0      5.0
     Kol  900  874  676    1379       8.0       8.0         6.0      2.0
     Mum  899  217  674    1443       9.0       9.0         7.0      1.0
     NCR  931  863  605    1935       5.0       6.0         4.0      3.0
Pvt  Blr  966  805  695     119       2.0       3.0         2.0      2.0
     Mum  925  839  615     154       7.0       7.0         5.0      1.0

In [240]:
df4

,Vol,Rev,Exp,Catg,EmpCnt,HQ,min_rank,max_rank,dense_rank,Volrank
HCL,931,863,605,Pub,1935,NCR,5.0,6.0,4.0,3.0
MRF,992,821,665,Pub,1154,Che,1.0,1.0,1.0,5.0
ISROACL,931,881,650,Gov,1361,Blr,5.0,6.0,4.0,1.0
Reliance,899,217,674,Pub,1443,Mum,9.0,9.0,7.0,1.0
BCCI,925,839,615,Pvt,154,Mum,7.0,7.0,5.0,1.0
Birla,900,874,676,Pub,1379,Kol,8.0,8.0,6.0,2.0
Flipkart,966,805,695,Pvt,119,Blr,2.0,3.0,2.0,2.0
Apollo,966,863,608,Pub,1656,Che,2.0,3.0,2.0,4.0
IR,954,833,609,Gov,13023,NCR,4.0,4.0,3.0,2.0

In [241]:
df4.sort_values(by = ['Catg','HQ'])

,Vol,Rev,Exp,Catg,EmpCnt,HQ,min_rank,max_rank,dense_rank,Volrank
ISROACL,931,881,650,Gov,1361,Blr,5.0,6.0,4.0,1.0
IR,954,833,609,Gov,13023,NCR,4.0,4.0,3.0,2.0
MRF,992,821,665,Pub,1154,Che,1.0,1.0,1.0,5.0
Apollo,966,863,608,Pub,1656,Che,2.0,3.0,2.0,4.0
Birla,900,874,676,Pub,1379,Kol,8.0,8.0,6.0,2.0
Reliance,899,217,674,Pub,1443,Mum,9.0,9.0,7.0,1.0
HCL,931,863,605,Pub,1935,NCR,5.0,6.0,4.0,3.0
Flipkart,966,805,695,Pvt,119,Blr,2.0,3.0,2.0,2.0
BCCI,925,839,615,Pvt,154,Mum,7.0,7.0,5.0,1.0